{
  "NotFound": {
    "title": "Page not found",
    "description": "Unfortunately, this page does not exist. Please try returning to the",
    "homepage": "homepage"
  },
  "Header": {
    "skills": "Skills",
    "softSkills": "Soft Skills",
    "experience": "Experience"
  },
  "DownloadCV": {
    "button": "Download CV (PDF)"
  },
  "About": {
    "name": "Denis Galetin",
    "role": "Senior Backend Developer | PHP & Go",
    "title": "About me",
    "imageAlt": "Denis Galetin - Senior Backend Developer | PHP & Go",
    "p1": "Backend developer with 9+ years in PHP and 4 in Go, with a background in Information Security. I design and scale high-load payment systems and financial services",
    "p2": "I lead architecture, improve critical performance, and establish development processes. I launch projects from scratch and scale existing solutions for growth",
    "p3": "Based in Tbilisi, Georgia. Open to full-time remote positions. Contact me to discuss your project context and goals",
    "contactTitle": "Contact",
    "locationValue": "Tbilisi, Georgia",
    "remoteAvailable": "Remote",
    "telegram": "Telegram",
    "github": "GitHub",
    "linkedin": "LinkedIn"
  },
  "TechStack": {
    "title": "Technical Skills",
    "PHP": "My primary language for 9+ years. Built and scaled high-load systems. Use PHP-FPM and OPcache to handle thousands of requests per second",
    "Go": "4 years of production use across financial and logistics platforms. Design services using standard library patterns to keep dependencies minimal. Leverage goroutines for concurrent workloads and build microservices that handle real production load",
    "MySQL": "Prefer Percona Server for advanced monitoring and performance under load. Work with query optimization, indexing, and replication",
    "Redis": "Use for caching and real-time data. Configure persistence and replication",
    "Laravel": "My favorite framework for PHP projects. Value it for the active community, rich ecosystem, and development speed",
    "REST APIs": "Designed and implemented dozens of APIs following best practices and OpenAPI specs. Worked on enterprise projects with high security and performance requirements",
    "Docker": "Containerize everything. Use multi-stage builds to optimize image size, docker-compose for local development and production deployments",
    "PostgreSQL": "Prefer it for complex queries and data integrity. Use partitioning for large tables and actively work with JSONB",
    "Microservices": "Worked on migrations from monoliths to microservices. Implemented API Gateway, service discovery, distributed tracing (Jaeger), and circuit breakers for fault tolerance. Know the trade-offs well",
    "CI/CD": "Build automated deployment processes. Worked with GitHub Actions, GitLab CI, Jenkins. Implemented automated testing and zero-downtime release strategies",
    "RabbitMQ": "Work with message queues for async processing and communication between services",
    "Kubernetes": "Deploy applications to production. Use Helm for release management, configure autoscaling under load",
    "Symfony": "Use for enterprise projects. Built applications for fintech and high-load systems",
    "Linux": "Work in Linux environments. Write bash scripts, configure services, troubleshoot performance issues",
    "AI": "Use AI tools (GitHub Copilot, ChatGPT) to accelerate development. Always review and validate generated code before committing",
    "AWS": "Use S3 for object storage, EC2 for compute, and integrate AWS SDK in backend services. Worked with AWS infrastructure in production environments",
    "Azure": "Used Azure cloud services in enterprise projects. Experience with Azure deployment pipelines and cloud resource management"
  },
  "SoftSkills": {
    "title": "Soft Skills",
    "communication": "People & Communication",
    "communicationDesc": "I keep communication transparent with teams and stakeholders, document decisions, and share status and risks clearly",
    "responsibility": "Ownership & Reliability",
    "responsibilityDesc": "I take ownership of service stability and outcomes. Reliability, predictability, and user trust are the priority",
    "organization": "Organization & Planning",
    "organizationDesc": "I plan work, estimate timelines and risks, and maintain a steady delivery cadence",
    "adaptability": "Adaptability",
    "adaptabilityDesc": "I quickly learn new technologies and adopt modern approaches when they improve product quality"
  },
  "Experience": {
    "title": "Professional Experience",
    "present": "Present",
    "vensonPosition": "Senior Backend Developer (PHP/Go)",
    "vensonAch1": "Led monolith-to-microservices migration: extracted deposits and withdrawals services, reducing deployment time from 2 hours to 15 minutes. Continuing architectural decomposition in a team of 5 backend developers",
    "vensonAch2": "Design system architecture, document technical decisions, and conduct code reviews. Mentor 2 middle developers, help with architectural decisions",
    "vensonAch3": "Develop payment APIs for financial services",
    "vensonAch4": "Configure CI/CD pipelines to automate deployment and testing. Manage Kubernetes clusters on AWS for production workloads",
    "vensonAch5": "Write unit and integration tests for critical services, set up monitoring and alerting. Achieved 99.8% uptime SLA for payment services through systematic reliability improvements and incident response processes",
    "vensonAch6": "Optimize slow SQL queries: reduced reporting query execution time from 8 seconds to 200 ms, enabling real-time reports for 200k+ users",
    "vensonAch7": "Refactor legacy code, apply SOLID principles and design patterns",
    "vensonAch8": "Develop internal tools to automate team's routine tasks",
    "logyPosition": "Senior Backend Developer (PHP/Go)",
    "logyAch1": "Built backend for a logistics SaaS platform processing 5k+ orders daily. Team of 4 developers",
    "logyAch2": "Extracted authentication into a separate Go microservice",
    "logyAch3": "Normalized the database: migrated legacy tables without foreign keys to new schema with FK constraints",
    "logyAch4": "Implemented an alternative payments module with multiple provider integrations",
    "logyAch5": "Built push notifications microservice for shipment status with Firebase integration",
    "logyAch6": "Initiated PHP modernization (5.6 → 7.4): resolved 15k lines of technical debt, introduced strict typing and type hints. Established migration roadmap toward PHP 8.x",
    "albatoPosition": "PHP Developer (contract)",
    "albatoAch1": "Worked on integration platform backend connecting 200+ third-party services, processing 50k+ API requests daily for 3k+ active business clients",
    "albatoAch2": "Built PHP worker system for asynchronous processing of CPU-intensive automation tasks, accelerated automation execution by 60% through parallelization",
    "albatoAch3": "Optimized database architecture and slow queries, improving response times for critical endpoints",
    "paykassmaPosition": "PHP Developer",
    "paykassmaAch1": "Worked across two product teams within Paykassma's company group over 2+ years: launched on the gateway product team, then moved to the core fintech platform — taking on broader ownership of payment infrastructure",
    "paykassmaAch2": "Developed payment gateway backend with embeddable iframe widget; integrated multiple payment providers through a unified API gateway with retry and webhook notification system for payment statuses",
    "paykassmaAch3": "Set up transaction table partitioning by dates: split a 50M+ record table into monthly partitions, automated archiving of data older than 6 months — eliminating performance degradation as data grew",
    "paykassmaAch4": "Integrated payment gateway with multiple banks and processing centers; developed internal API for transactions and user balance management",
    "paykassmaAch5": "Optimized SQL queries and database structure: refactored transactional queries, added indexes on frequently accessed fields, reduced response time from 2-3 seconds to 100-150 ms",
    "paykassmaAch6": "Covered critical financial operations with tests, implemented automated e2e testing",
    "paykassmaAch7": "Set up transaction monitoring and alerting for payment anomalies",
    "paykassmaAch8": "Optimized payment processing pipeline: eliminated redundant logic and unnecessary DB round-trips, improving throughput under load",
    "freelancePosition": "Freelance PHP Developer / Startup Projects",
    "freelanceAch1": "Developed web applications and payment integrations for small businesses and startups",
    "freelanceAch2": "Worked directly with clients: gathered requirements, designed solutions, maintained launched projects",
    "freelanceAch3": "Managed full project lifecycle independently: provisioned Linux VPS environments, configured Nginx, MySQL, and PHP-FPM from scratch, handled deployments and production support",
    "freelanceAch4": "Participated in a startup project in the online payments space, gained first experience with high-load systems"
  }
}
