{
  "NotFound": {
    "title": "გვერდი ვერ მოიძებნა",
    "description": "სამწუხაროდ, ეს გვერდი არ არსებობს. გთხოვთ დაბრუნდეთ",
    "homepage": "მთავარ გვერდზე"
  },
  "Header": {
    "skills": "უნარები",
    "softSkills": "რბილი უნარები",
    "experience": "გამოცდილება"
  },
  "DownloadCV": {
    "button": "CV-ის ჩამოტვირთვა (PDF)"
  },
  "About": {
    "name": "დენის გალეტინი",
    "role": "უფროსი Backend დეველოპერი | PHP & Go",
    "title": "ჩემს შესახებ",
    "imageAlt": "დენის გალეტინი - უფროსი Backend დეველოპერი | PHP & Go",
    "p1": "Backend დეველოპერი 9+ წელით PHP-ში და 4 წელით Go-ში, ინფორმაციული უსაფრთხოების განათლებით. ვაპროექტებ და ვასკალავ მაღალდატვირთულ გადახდის სისტემებს და ფინანსურ სერვისებს",
    "p2": "ვხელმძღვანელობ არქიტექტურას, ვაუმჯობესებ კრიტიკულ პერფორმანსს და ვაყალიბებ განვითარების პროცესებს. ვიწყებ პროექტებს ნულიდან და ვასკალავ არსებულ გადაწყვეტილებებს ზრდისთვის",
    "p3": "ვმდებარეობ თბილისში, საქართველოში. ღია ვარ full-time დისტანციურ პოზიციებზე. დამიკავშირდეთ, რომ განვიხილოთ თქვენი პროექტის კონტექსტი და მიზნები",
    "contactTitle": "კონტაქტი",
    "locationValue": "თბილისი, საქართველო",
    "remoteAvailable": "დისტანციური",
    "telegram": "Telegram",
    "github": "GitHub",
    "linkedin": "LinkedIn"
  },
  "TechStack": {
    "title": "ტექნიკური უნარები",
    "PHP": "ჩემი ძირითადი ენა 9+ წლის განმავლობაში. ავაშენე და გავზარდე მაღალი დატვირთვის სისტემები. ვიყენებ PHP-FPM და OPcache ათასობით მოთხოვნის დამუშავებისთვის წამში",
    "Go": "4 წელი production-ში გამოყენება ფინანსურ და ლოჯისტიკურ პლატფორმებში. ვაპროექტებ სერვისებს სტანდარტული ბიბლიოთეკის პატერნებით. ვიყენებ goroutines-ებს კონკურენტული სამუშაო დატვირთვებისთვის",
    "MySQL": "ვამჯობინებ Percona Server-ს გაფართოებული მონიტორინგისა და მუშაობის დატვირთვის ქვეშ გამო. ვმუშაობ მოთხოვნების ოპტიმიზაციაზე, ინდექსებზე და რეპლიკაციაზე",
    "Redis": "ვიყენებ კეშირებისთვის და რეალურ დროში მონაცემებისთვის. ვაკონფიგურირებ persistence და რეპლიკაციას",
    "Laravel": "ჩემი საყვარელი ფრეიმვორქი PHP პროექტებისთვის. ვაფასებ აქტიური კომიუნიტის, მდიდარი ეკოსისტემისა და განვითარების სისწრაფის გამო",
    "REST APIs": "დავპროექტე და განვახორციელე ათობით API საუკეთესო პრაქტიკისა და OpenAPI სპეციფიკაციების მიხედვით. ვმუშაობდი enterprise პროექტებზე უსაფრთხოებისა და მუშაობის მაღალი მოთხოვნებით",
    "Docker": "ვაკონტეინერებ ყველაფერს. ვიყენებ multi-stage builds-ს სურათების ზომის ოპტიმიზაციისთვის, docker-compose-ს ლოკალური განვითარებისთვის და production განლაგებისთვის",
    "PostgreSQL": "ვამჯობინებ რთული მოთხოვნებისთვის და მონაცემთა მთლიანობისთვის. ვიყენებ partitioning-ს დიდი ცხრილებისთვის და აქტიურად ვმუშაობ JSONB-თან",
    "Microservices": "ვმუშაობდი მიგრაციებზე მონოლითებიდან მიკროსერვისებზე. დავნერგე API Gateway, service discovery, distributed tracing (Jaeger) და circuit breakers გაუმართაობის ტოლერანტობისთვის. კარგად ვიცი trade-offs",
    "CI/CD": "ვაშენებ ავტომატური deployment პროცესებს. ვმუშაობდი GitHub Actions, GitLab CI, Jenkins-თან. დავნერგე ავტოტესტები და zero-downtime რელიზის სტრატეგიები",
    "RabbitMQ": "ვმუშაობ მესიჯების რიგებთან (ასინქრონული დამუშავება და სერვისებს შორის კომუნიკაცია)",
    "Kubernetes": "ვანაწილებ აპლიკაციებს production-ზე. ვიყენებ Helm-ს რელიზების მართვისთვის, ვაკონფიგურირებ ავტოსკეილინგს დატვირთვის ქვეშ",
    "Symfony": "ვიყენებ enterprise პროექტებისთვის. ავაშენე აპლიკაციები ფინტექისა და მაღალი დატვირთვის სისტემებისთვის",
    "Linux": "ვმუშაობ Linux გარემოში. ვწერ bash script-ებს, ვაკონფიგურირებ სერვისებს, ვაგვარებ პერფორმანსის პრობლემებს",
    "AI": "ვიყენებ AI ინსტრუმენტებს (GitHub Copilot, ChatGPT) განვითარების დასაჩქარებლად. ყოველთვის ვამოწმებ და ვალიდირებ გენერირებულ კოდს commit-ამდე",
    "AWS": "ვიყენებ S3-ს ობიექტების საკინაბედ, EC2 გამოთვლეკებისთვის და AWS SDK-ს ინტეგრაციისთვის backend სერვისებში. ვმუშაოდი AWS ინფრასტრუქტურასთან production გარემოში",
    "Azure": "გამოვიყენე Azure დიდი enterprise პროექტებში. გამოცდილება Azure deployment pipelines-ადა და cloud რესურსების მართვასთან"
  },
  "SoftSkills": {
    "title": "Soft Skills",
    "communication": "კომუნიკაცია და თანამშრომლობა",
    "communicationDesc": "ვინარჩუნებ გამჭვირვალე კომუნიკაციას გუნდთან და სტეიკჰოლდერებთან, ვაფიქსირებ გადაწყვეტილებებს და ვუზიარებ სტატუსსა და რისკებს",
    "responsibility": "პასუხისმგებლობა",
    "responsibilityDesc": "ვიღებ პასუხისმგებლობას სერვისების სტაბილურობასა და შედეგებზე. პრიორიტეტია საიმედოობა, პროგნოზირებადობა და მომხმარებელთა ნდობა",
    "organization": "ორგანიზებულობა",
    "organizationDesc": "ვგეგმავ სამუშაოს, ვაფასებ ვადებსა და რისკებს და ვინარჩუნებ სტაბილურ მიწოდების რიტმს",
    "adaptability": "ადაპტირების უნარი",
    "adaptabilityDesc": "სწრაფად ვსწავლობ ახალ ტექნოლოგიებს და ვნერგავ თანამედროვე მიდგომებს, როცა ეს აუმჯობესებს პროდუქტის ხარისხს"
  },
  "Experience": {
    "title": "პროფესიული გამოცდილება",
    "present": "ამჟამად",
    "vensonPosition": "Senior Backend დეველოპერი (PHP/Go)",
    "vensonAch1": "ვხელმძვანელობდი მონოლითიდან მიკროსერვისებზე გადასვლას: გამოვიტანე შევსებებისა და გატანების სერვისები, deployment-ის დრო 2 საათიდან 15 წუთამდე შემცირე. ვაგრძელებ არქიტექტურულ დეკომპოზიციას 5 backend დეველოპერის გუნდში",
    "vensonAch2": "ვპროექტუჯ სისტემების არქიტექტურას, ვადოკუმენტირებ ტექნიკურ გადაწყვეტილებებს და ვატარებ code review-ებს. ვმენტორობ 2 middle დეველოპერს, ვეხმარები არქიტექტურულ გადაწყვეტილებებში",
    "vensonAch3": "ვამუშავებ გადახდის API-ებს ფინანსური სერვისებისთვის",
    "vensonAch4": "ვკონფიგურირებ CI/CD pipeline-ებს deployment-ისა და ტესტირების ავტომატიზაციისთვის. ვმართავ Kubernetes cluster-ებს AWS-ზე production სამუშაო დატვირთვებისთვის",
    "vensonAch5": "ვწერ unit და integration ტესტებს კრიტიკული სერვისებისთვის, ვაკონფიგურირებ მონიტორინგსა და alerting-ს. მივაღწიე 99.8% uptime SLA გადახდის სერვისებისთვის სისტემატური საიმედოობის გაუმჯობესა და ინციდენტებზე რეაგირების პროცესების საშუალებით",
    "vensonAch6": "ვაოპტიმიზირებ ნელ SQL query-ებს: შევმცირე ანგარიშების query-ების შესრულების დრო 8 წამიდან 200 მს-მდე, რაც გააქტიურა რეალურ დროში ანგარიშები 200k+ მომხმარებლისთვის",
    "vensonAch7": "ვარეფაქტორებ legacy კოდს, ვიყენებ SOLID პრინციპებსა და დიზაინ პატერნებს",
    "vensonAch8": "ვამუშავებ შიდა ინსტრუმენტებს გუნდის რუტინული დავალებების ავტომატიზაციისთვის",
    "logyPosition": "Senior Backend დეველოპერი (PHP/Go)",
    "logyAch1": "დავამუშავე ლოგისტიკური SaaS პლატფორმის backend, რომელიც ამუშავებს 5k+ შეკვეთას ყოველდღიურად. 4 დეველოპერის გუნდი",
    "logyAch2": "გამოვიტანე ავტორიზაცია ცალკე Go მიკროსერვისში",
    "logyAch3": "გავაკეთე ბაზის ნორმალიზაცია: გადავიტანე legacy ცხრილები FK-ების გარეშე ახალ სქემაზე foreign key შეზღუდვებებით",
    "logyAch4": "დავამუშავე ალტერნატიული გადახდების მოდული რამდენიმე პროვაიდერის ინტეგრაციით",
    "logyAch5": "დავამუშავე push შეტყობინებების მიკროსერვისი ტვირთის სტატუსისთვის Firebase ინტეგრაციით",
    "logyAch6": "დავიწყე PHP მოდერნიზაცია (5.6 → 7.4): მოვგვარე 15k ხაზი ტექნიკური ვალი, შემოვიდე strict typing და type hints. შევქმნე მიგრაციის გზამკვლევი PHP 8.x-ზე გადასვლისთვის",
    "albatoPosition": "PHP დეველოპერი (კონტრაქტი)",
    "albatoAch1": "ვმუშაობდი ინტეგრაციის პლატფორმის backend-ზე, რომელიც აკავშირებს 200+ მესამე მხარის სერვისს და ამუშავებს 50k+ API მოთხოვნას ყოველდღიურად 3k+ აქტიური ბიზნეს კლიენტისთვის",
    "albatoAch2": "დავამუშავე PHP worker სისტემა CPU-intensive ავტომატიზაციის დავალებების ასინხრონული დამუშავებისთვის, გავაჩქარე ავტომატიზაციების შესრულება 60%-ით პარალელიზაციის გამო",
    "albatoAch3": "გავაოპტიმიზირე database არქიტექტურა და ნელი query-ები, გავაუმჯობესე პასუხის დრო კრიტიკულ endpoint-ებზე",
    "paykassmaPosition": "PHP დეველოპერი",
    "paykassmaAch1": "Paykassma-ს კომპანიის ჯგუფში 2+ წლის განმავლობაში ვმუშაობდი ორ product გუნდში: დავიწყე gateway პროდუქტის გუნდში, შემდეგ გადავედი ძირითად fintech პლატფორმაზე — payment ინფრასტრუქტურაზე უფრო ფართო პასუხისმგებლობით",
    "paykassmaAch2": "დავამუშავე გადახდის gateway-ის backend დასაინტეგრირებელი iframe ვიჯეტით; დავაინტეგრირე რამდენიმე გადახდის პროვაიდერი ერთიანი API gateway-ის საშუალებით retry და webhook შეტყობინებებით",
    "paykassmaAch3": "დავაყენე ტრანზაქციების ცხრილების პარტიციონირება თარიღების მიხედვით: გავიყავი ცხრილი 50M+ ჩანაწერით თვიურ პარტიციებად, ავტომატური არქივაცია 6 თვის უფროსი მონაცემებისთვის — მონაცემთა ზრდასთან დაკავშირებული პერფორმანსის გაუარესება გავაუქმე",
    "paykassmaAch4": "დავაინტეგრირე გადახდის gateway რამდენიმე ბანკთან და processing ცენტრებთან; დავამუშავე შიდა API ტრანზაქციებისა და მომხმარებლის ბალანსების მართვისთვის",
    "paykassmaAch5": "გავაოპტიმიზირე SQL query-ები და database სტრუქტურა: გადავამუშავე ტრანზაქციური query-ები, დავამატე ინდექსები ხშირად გამოყენებულ ველებზე, შევმცირე პასუხის დრო 2-3 წამიდან 100-150 მს-მდე",
    "paykassmaAch6": "კრიტიკული ფინანსური ოპერაციები დავცარიე ტესტებით, დავამუშავე ავტომატიზირებული e2e testing",
    "paykassmaAch7": "დავაყენე ტრანზაქციების monitoring და alerting გადახდის ანომალიებისთვის",
    "paykassmaAch8": "გავაოპტიმიზირე გადახდის დამუშავების pipeline: ჭარბული ლოგიკა და არასაჭებელი DB round-trip-ები გავანეკე, გავაუმჯობესა throughput დატვირთვის ქვეშ",
    "freelancePosition": "ფრილანს PHP დეველოპერი / სტარტაპ პროექტები",
    "freelanceAch1": "ვამუშავებდი ვებ აპლიკაციებს და გადახდის ინტეგრაციებს მცირე ბიზნესებისა და სტარტაპებისთვის",
    "freelanceAch2": "ვმუშაობდი კლიენტებთან პირდაპირ: ვაგროვებდი მოთხოვნებს, ვპროექტავდი გადაწყვეტილებებს, ვახორციელებდი დასრულებული პროექტების მხარდაჭერას",
    "freelanceAch3": "ვმართავდი პროექტების სრულ სასიცოცხლო ციკლს დამოუკიდებლად: ვამზადებდი Linux VPS გარემოებს, ვაკონფიგურირებდი Nginx, MySQL და PHP-FPM-ს ნულიდან, ვახორციელდი deployment-ებსა და production-ის მხარდაჭერას",
    "freelanceAch4": "მივიღე მონაწილეობა სტარტაპ პროექტში ონლაინ გადახდების სფეროში, მივიღე პირველი გამოცდილება მაღალტვირთიან სისტემებთან მუშაობაში"
  }
}
